summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxSbcu_bf.h
/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_SBCU_DBCNTL_ONBOS2_OFF (30)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_OFF (31)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_OFF (16)

/** \\brief  Length for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32)

/** \\brief  Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_OFF (7)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU1 */
#define IFX_SBCU_DBGNTT_CPU1_OFF (8)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_LEN (8)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_OFF (16)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_OFF (15)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_OFF (5)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ETH */
#define IFX_SBCU_DBGNTT_ETH_OFF (2)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSSL */
#define IFX_SBCU_DBGNTT_HSSL_OFF (3)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE0 */
#define IFX_SBCU_DBGNTT_ONE0_OFF (1)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE1 */
#define IFX_SBCU_DBGNTT_ONE1_OFF (4)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE2 */
#define IFX_SBCU_DBGNTT_ONE2_OFF (6)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_LEN (6)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_MSK (0x3f)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE3 */
#define IFX_SBCU_DBGNTT_ONE3_OFF (9)

/** \\brief  Length for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_LEN (8)

/** \\brief  Mask for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_MSK (0xff)

/** \\brief  Offset for Ifx_SBCU_DBGNTT_Bits.ONE4 */
#define IFX_SBCU_DBGNTT_ONE4_OFF (24)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_OFF (7)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU1 */
#define IFX_SBCU_DBGRNT_CPU1_OFF (8)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_OFF (15)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_LEN (1)

/** \\brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_MSK (0x1)

/** \\brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_OFF (5)

/** \\brief  Length for Ifx_SBCU_DBGRNT_Bits.ETH */
#define IFX_SBCU_DBGRNT_ETH_LEN (1)

