summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxSbcu_bf.h
/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_OFF (4)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_OFF (8)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_OFF (12)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDC */
#define IFX_SBCU_PRIOH_RESERVEDC_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDC */
#define IFX_SBCU_PRIOH_RESERVEDC_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDC */
#define IFX_SBCU_PRIOH_RESERVEDC_OFF (16)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDD */
#define IFX_SBCU_PRIOH_RESERVEDD_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDD */
#define IFX_SBCU_PRIOH_RESERVEDD_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDD */
#define IFX_SBCU_PRIOH_RESERVEDD_OFF (20)

/** \\brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_OFF (24)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_OFF (28)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_OFF (0)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_OFF (20)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.ETH */
#define IFX_SBCU_PRIOL_ETH_OFF (8)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.HSSL */
#define IFX_SBCU_PRIOL_HSSL_OFF (12)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_OFF (4)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_OFF (16)

/** \\brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_LEN (4)

/** \\brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_MSK (0xf)

/** \\brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_OFF (24)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_BF_H */
